["My account", "Change My Password", "Logout", "Search", "Autos", "Homes", "Careers", "Classified", "Obituaries", "Sun Media", "\n\t\t\t\t\t\t\t\t\tTuesday, June 9, 2015\n\n\t", "Spruce Grove, AB", "13°", "Overcast", "\nWeather Sponsorship", " available!\t\t\t\t\t\t\t\t", "Home", "News", "Sports", "Entertainment", "Life", "Money", "Opinion", "Contests", "UR", "Marketplace", "Newsstand", "Photos", "Videos", "Events", "Polls", "Weather", "More", "Local", "Provincial", "Canada", "World", "\n                    News\n                        ", "Canada", "Edmonton", "Officer shot and killed in west Edmonton \t", "0", "\n\t\t\t\t\t\t\t\t\tTuesday, June 9, 2015\n\t\t\t\t\t\t1:38:22 MDT AM\n\n\t", "Edmonton Police Service officers run along 184 Street near Callingwood Road near where a police officer was shot and killed on Monday. Police and firefighters surrounded a house at 18620 62A Avenue that was burning. (Ian Kucerak/EDMONTON SUN)", "Tweet", "Change text size for the story", "Print", "Report an error", "If the Storify doesn't load above, please click here.", "An Edmonton city police officer recruited from Greater Manchester Police Force has been killed in the line of duty during a fiery shooting scene that was still unfolding Monday night.", "Hate crimes officer Const. Dan Woodall,35, was gunned down while attempting to serve an arrest warrant on a man at a home business near 186 Street and 62A Avenue around 8 p.m.", "His partner, Jason Harley, 38, also suffered gunshot wounds, with at least one to the back, and was transported to hospital from the scene which became more chaotic when a fire, possibly intentionally started by the gunman, broke out. The shots were fired from inside the home.", "Sources within the police force confirmed the man being targeted by undercover officers for some time was Norman Raddatz, thought to be associated with Freemen of the Land. Police and fire crews were unable to reach Woodall’s body as the blaze grew to a two-alarm fire.", "Woodall was recruited from Greater Manchester Police Force and has been with the Edmonton Police Service for about a decade.", "Deputy Police Chief Danielle Campbell later Monday night confirmed to officers that Woodall had died.", "Officers were in tears, trying to console one another after hearing the news.", "“You never know with these guys on the extreme side,” said one emotional officer of the man wanted on warrants.", "Of the killer, he said through tears, “I hope he burns in hell.”", "Woodall is the second officer to die in the line of duty since Const. Ezio Faraone was fatally shot during an armed robbery on June 25, 1990.", "At a press conference later Monday night, police Chief Rod Knecht called the incident \"a tragedy of unspeakable proportions.\"", "\"It's terrible. It's a police officer's worst nightmare. There's nothing worse.\" said Knecht.", "Woodall leaves behind his wife and two children.", "\"Const. Woodall gave his life tonight in service of the citizens of this city and to this country,\" said Knecht. \"His job was to protect all of us from harm, victimization, and from criminal activity.", "\"We will forever be in his debt for his actions this evening. But of far greater importance, a wife is without a husband tonight and two young children are without a loving father.\"", "As of midnight on Monday, Knecht said police believed there was only one suspect, though no one has been taken into custody. Last time officers saw the suspect was inside the burning home, which Knecht says burned to the ground.", "“Ì don't believe there is a danger to the public at this time,” said Knecht.", "Knecht said Woodall was struck \"multiple times.\" He also credited a bullet proof vest for saving Harley's life.", "Knecht closed Monday's press conference with a message to his officers", "“My heart goes out to them. This is a very difficult time for all of them, and certainly for all of their families,” said Knecht. “This strikes at the very heart of every police officer.”", "Alberta Serious Incident Response Team (ASIRT) are taking over the investigation.", "Police will update media at 8:30 a.m. on Tuesday morning.", "On scene at EPS shooting in Callingwood area. Reports of an officer shot in the back. ", "#yeg", "#yegcrime", "pic.twitter.com/timXQWaakF", "\r\n— Trevor Robb (@SunTrevorRobb) ", "June 9, 2015", "One witness heard repeatedly saying \"he set it on fire. He set it on fire.\" ", "#yeg", "pic.twitter.com/AGC2OWH5z0", "\r\n— Trevor Robb (@SunTrevorRobb) ", "June 9, 2015", "Police officers have gathered in front of the home and some are on top of the roof. Visible flames. ", "#yeg", "pic.twitter.com/ItkRnfAnk6", "\r\n— Trevor Robb (@SunTrevorRobb) ", "June 9, 2015", "Featured Businesses", "Contact us to Advertise »", "\t\t\t\t\t\t\t\t\t\tReal Estate\n", "Melcor Developement", "\t\t\t\t\t\t\t\t\t\tRetail\n", "North Central Co-Op", "\t\t\t\t\t\t\t\t\t\tReal Estate\n", "Melcor Developement", "Go to the Marketplace »", "Local Businesses", "Advertise with us", "Contribute", "Send Your Scoop!", "Share your story, photo or video about something you've seen.", "Send your story", "E-Editions", "View, submit, participate!", "Advertise", "Advertise online", "Announce your business", "Reach potential customers", "Contribute", "Send us news, photos or videos", "Add an event to the calendar", "Follow Spruce Grove Examiner", "Search", "News", "Local", "Provincial", "Canada", "World", "Sports", "High School Sports", "Hockey", "Other Sports", "Entertainment", "Local", "Movies", "Celebrities", "Life", "Health", "Food", "Travel", "Opinion", "Editorial", "Letters", "Column", "UR", "Entertainment", "Life", "Money", "News", "Opinion", "Sports", "Money", "Contests", "Marketplace", "Newsstand", "Photos", "Videos", "Events", "Polls", "Weather", "Reader services", "Advertise", "Online", "Print", "Spruce Grove Examiner", "Feedback", "Letters to the editor", "Sun Media Publications", "Services", "Autos", "Homes", "Classifieds", "Careers", "Obituaries", "Sitemap", "Privacy", "Terms", "Netiquette", "Research", "Contact-us", "©  2015 Spruce Grove Examiner. All rights reserved. The Spruce Grove Examiner are members of ", "Canoe Sun Media ", "Community Newspapers.", "Powered by Fatwire"]