["×", "Like what you're reading?", "Never miss a thing with the HuffPost Politics newsletter! ", "  Sign me up for \n\t\t       \t\t       ", "\n\t\t      The Morning Email", ", too.\n                \n\t\t       ", "Newsletter may include personalized content.", "\n\t   Learn more", ".", "June 11, 2015", "Huffpost Politics", "\n\t\tEdition: ", "U.S.", "Show/Hide", "Brasil", "BR", "Canada", "CA", "Deutschland", "DE", "España", "ES", "France", "FR", "Ελλάδα (Greece)", "GR", "India", "IN", "Italia", "IT", "日本 (Japan)", "JP", "한국 (Korea)", "KR", "Maghreb", "MG", "United Kingdom", "UK", "United States", "US", "Follow", "Newsletters", "Get PoliticsNewsletters", "Email address", "Enter Email Address", "Huffington Post Search", "Search The Huffington Post", "Enter Search Terms", "Submit Search", "iOS app", "Android app", "More", "Desktop Alerts", "Log in", "Create Account", "$USERNAME", "Desktop Notifications", "Profile", "Settings", "\n                                                Logout                                            ", "FRONT PAGE", "Politics", "GOP Readies New Obamacare Hostage Plan As Supreme Court Drama Builds", "1K", "Jeb Bush: Unwed Mothers Should Be Publicly Shamed", "3K", "Jamie Dimon Wants To Mansplain Banking To Elizabeth Warren", "666", "Cop's Pool Party Barrel Roll Makes More Sense With A Beastie Boys Soundtrack", "1K", "Top Dem Warns GOP To Deal Now Or Risk Another Government Shutdown", "971", "Go to Politics", "More in Politics", "Pollster", "Politics Blog", "Off The Bus", "Election Maps", "Trail To The Chief", "You Might Also Like", "WorldPost", "Green", "Black Voices", "Latino Voices", "Gay Voices", "Business", "Here Are The Companies With The Biggest Revenues In Each State", "52", "Focusing On Women's Advancement Blinds Companies To Their Real Problem", "84", "Walmart Could Get $100 Million Hit After Judge Finds Wage Violations", "56", "J. Crew Just Laid Off A Bunch Of Its Corporate Staff", "14", "Prisoners Pay Millions To Call Loved Ones Every Year. Now This Company Wants Even More.", "24", "Go to Business", "More in Business", "Small Biz", "Money", "You Might Also Like", "WorldPost", "Tech", "Media", "Arts", "Sports", "Weird News", "Smarter Ideas", "Urban Progress", "Entertainment", "Duggar Family Reportedly Under New Investigation By Arkansas DHS", "2K", "15 Movie Mistakes You Hadn't Noticed In Your Favorite Films", "271", "J.Lo Is The Only Reason To Watch The 'Back It Up' Video", "31", "Carrie Underwood Is A Knockout At CMT Music Awards", "44", "Holly Madison Talks 'Misery' In The Playboy Mansion", "111", "Go to Entertainment", "More in Entertainment", "Celebrity", "TV", "You Might Also Like", "Comedy", "Arts", "Books", "Food", "Style", "Weird News", "Moviefone", "Media", "Lindsey Graham Tells Off Sean Hannity: 'Your Solutions Don't Work'", "422", "Bernie Sanders Snaps At Journalist For Calling Him An Israeli Citizen", "366", "Rupert Murdoch Stepping Down As CEO Of 21st Century Fox", "261", "Rachel Maddow Is The Only Cable News Host To Make This List", "443", "Green-Haired Crash Witness Gives Best Interview Ever", "18", "Go to Media", "More in Media", "Eat The Press", "Calderone: The Backstory", "You Might Also Like", "Entertainment", "TV", "Comedy", "Arts", "Books", "Religion", "Moviefone", "WorldPost", "ISIS Took Control Of Mosul One Year Ago. This Is What Life Is Like Now.", "178", "PHOTOS: An Intimate Look Inside The Capital Of The Hermit Kingdom", "0", "Prosecutor: Doctors Believed Germanwings Co-Pilot Was Unfit To Fly", "0", "Tourists Arrested In Malaysia After Their Naked Photo Was Blamed For Earthquake", "114", "Israel May Have Spied On Iran Nuclear Talks Hotel: Report", "320", "Go to WorldPost", "More in WorldPost", "Foreign Affairs", "Drug War", "Afghanistan", "Syria Conflict", "World Videos", "You Might Also Like", "Travel", "Politics", "Business", "Tech", "Religion", "Sports", "SI's American Pharoah Cover Epitomizes Everything Wrong With Society", "331", "Keith Olbermann Wants Hope Solo Suspended From World Cup", "225", "Bob Costas Questions ESPN's Motives Around Caitlyn Jenner's ESPY Award", "236", "All The Awful Things We've Learned About FIFA Since The Scandal Erupted", "133", "The Most Impressive Thing About LeBron's Finals Performance Isn't His Stats", "0", "Go to Sports", "More in Sports", "NFL", "College Football", "MLB", "Fails", "Highlights", "You Might Also Like", "TV", "Food", "Tech", "Comedy", "Weird News", "Tech", "King Of GIFs Says This Is The Best Gif Ever", "58", "Your Next iPhone's Camera Might Finally Get A Major Upgrade", "0", "EU Opens Antitrust Probe Of Amazon's E-Book Business", "10", "Nobody Fixed These Potholes Until The Potholes Asked For It Themselves", "3", "Please Don't Applaud Apple For Putting Women Onstage", "34", "Go to Tech", "More in Tech", "TEDWeekends", "Social Media", "You Might Also Like", "Small Biz", "Green", "Science", "NY", "SF", "Smarter Ideas", "TechCrunch", "Engadget", "Green", "Why Sharks Are Attacking More People Than Ever in Hawaii", "0", "Baby Koala Didn't Leave His Mother's Side In The Hospital", "152", "PHOTO: Twin Tornadoes Dance Under Massive Supercell", "16", "Cleanup Of California Oil Spill Costs Millions A Day With No End In Sight", "47", "Owner Dumps Cat... ", "For A New Couch", "56", "Go to Green", "More in Green", "Energy", "Climate Change", "Animals", "Green Tech", "Green Holiday", "You Might Also Like", "Politics", "Food", "WorldPost", "Science", "Healthy Living", "Gay Voices", "These 21 Words About Sex May Be The Most Important Words Miley Cyrus Has Ever Said", "0", "Man Refuses To Let Gay Man Cut His Son's Hair. The Salon's Response Is Priceless.", "0", "A Look At Ethics Of Gay Sex Games, Power Play On The NYC Stage", "4", "Kids' Reactions To Caitlyn Jenner's Photos Make Us Hopeful For The Future", "32", "YouTube Star Comes Out As Gay", "18", "Go to Gay Voices", "More in Gay Voices", "Transgender", "Bisexual", "Lesbian", "Gay Marriage", "Don't Ask, Don't Tell", "Voice to Voice", "Poll Position", "You Might Also Like", "Black Voices", "Latino Voices", "Style", "HuffPost Live", "Next", "Top Stories For Friday, June 12 ", "Next", "Morning Meditation Rituals", "Tomorrow", "Zach & Josh Braff LIVE", "Tomorrow", "Political Junkies: McKinney & White Fear", "Tomorrow", "#WorldBrief with @AlyonaMink", "Go to Huffpost Live", "All Sections", "News", "Politics", "WorldPost", "Business", "Small Business", "Money", "Media", "Sports", "Education", "Crime", "Weird News", "Good News", "Entertainment", "Entertainment", "Celebrity", "Comedy", "Arts & Culture", "Books", "TV", "Life & Style", "Healthy Living", "GPS for the Soul", "Style", "Home", "Taste", "Weddings", "Travel", "Parents", "Divorce", "Huff/Post 50", "Marlo Thomas", "OWN", "Dr. Phil", "Tech & Science", "Tech", "Science", "Green", "Code", "Voices", "Women", "Black Voices", "Latino Voices", "Voces (en español)", "Gay Voices", "Religion", "College", "Teen", "Impact", "Local", "Chicago", "DC", "Denver", "Detroit", "Hawaii", "Los Angeles", "Miami", "New York", "San Francisco", "Our Mobile Apps:", "iOS", "Android", "HuffPost Live (iOS)", "GPS For The Soul (iOS)", "GPS For The Soul (Android)", "Politics", "Pollster", "Elections 2014", "2016", "Eat The Press", "HuffPost Hill", "CPI", "Third Metric", "Howard Fineman's Political Read", "Jeb Bush: Unwed Mothers Should Be Publicly Shamed", "2015-06-09 10:31:31", "Jamie Dimon Wants To Mansplain Banking To Elizabeth Warren", "2015-06-10 16:19:58", "Cop's Pool Party Barrel Roll Makes More Sense With A Beastie Boys Soundtrack", "2015-06-09 14:21:00", "Ferguson: If Negligent, Careless Poor People Can't Make Bail, It's Their Fault", "2015-06-10 17:24:43", "Top Dem Warns GOP To Deal Now Or Risk Another Government Shutdown", "2015-06-10 10:00:10", "Lindsey Graham Is A 'Bro With No Ho,' According To Mark Kirk", "2015-06-11 12:46:58", "GOP Readies New Obamacare Hostage Plan As Supreme Court Drama Builds", "2015-06-11 07:29:20", "Trade Deal Targets Medicare, New Leak Reveals", "2015-06-10 16:08:55", "Duggar Family Reportedly Under New Investigation By Arkansas DHS", "2015-06-10 16:23:11", "SI's American Pharoah Cover Epitomizes Everything Wrong With Society", "2015-06-10 09:19:31", "Bernie Sanders Snaps At Journalist For Calling Him An Israeli Citizen", "2015-06-10 15:40:08", "Jon Stewart SHREDS The New York Times", "2015-06-11 06:02:55", "High School Students Create Haunting Artwork About Standardized Tests", "2015-06-10 16:34:14", "The Death Of Kalief Browder Is An 'American Tragedy Almost Beyond Words'", "2015-06-08 13:14:02", "Why So Many Domestic Violence Survivors Don't Get Help -- Even When They Ask For It", "2015-06-10 11:49:48", "Previous Story", "Next Story", "Nick Wing", "Become a fan", "nickw@huffingtonpost.com", "Email", "Police Killed An Unarmed White Man In Iowa And His Community Didn't Seem To Notice", "\n        Posted: ", "\n            06/11/2015  6:15 pm EDT        ", "\n        Updated: ", "\n            24 minutes ago        ", "Share", "Tweet", "Email", "Comment", "tumblr", "stumble", "reddit", "A few minutes before Des Moines police killed Ryan Keith Bolinger Tuesday night, the 28-year-old white man was dancing in the street, according to an officer. Police didn't find the display funny. In a news conference Wednesday, Des Moines Police Sgt. Jason Halifax said Bolinger ", "had earlier pulled up", " beside the squad car of an officer who was conducting an unrelated traffic stop, parking his 2000 Lincoln sedan so close that he blocked the police cruiser's driver's side door. Bolinger then left his vehicle and danced around before getting back in and driving away.", "Officer Vanessa Miller, a seven-year veteran of the force, gave pursuit, following Bolinger in a low-speed chase that hovered around the 35 miles-per-hour limit, officials said. The ", "Des Moines Register reports", " that Officer Ian Lawler, who had earlier been boxed in by Bolinger, radioed that he was joining Miller in the pursuit. He also suggested that they may be dealing with a drunk or mentally ill suspect.", "About two minutes into the chase, Miller cut Bolinger off as he attempted to make a U-turn, forcing his car to a stop. Bolinger exited his vehicle and approached Miller's squad car \"walking with a purpose,\" Halifax said. As he advanced, Miller, who is white, fired a single bullet through her rolled up driver's side window, shattering the glass and striking Bolinger in the torso. He later died from the gunshot wound at a local hospital.", "Halifax has said Bolinger was unarmed, and the Register reports that he had no criminal record. It remains unclear why he was behaving erratically. Halifax said he expects the case will eventually be considered by a grand jury, though in the meantime, the Des Moines Police Department is conducting its own investigation. While Miller was equipped with a microphone that should have picked up audio of the confrontation, her vehicle's dashboard camera didn't record the shooting, Halifax said. His officers are not yet equipped with body cameras, though in Miller's case, such a camera may not have provided useful footage, depending on her position at the time of the shooting.", "The incident comes as much of the nation's attention remains focused on the issue of police killings and accountability, especially since the fatal shooting of black 18-year-old Michael Brown in Ferguson, Missouri, last August. Bolinger's death was one of a string of officer-involved shootings this week that brought the total number of people killed by police nationwide to more than 500 so far this year, ", "according to data compiled by The Guardian", ". At least two more people have been killed since Bolinger died.", "Much of the grassroots outcry around the issue of police violence has been organized under the Black Lives Matter umbrella, as protests surrounding the killings of black men and women -- and the subsequent decisions not to charge, much less convict, the officers responsible for those deaths -- have arisen around the nation. Data shows that black Americans, particularly young black men, face a higher likelihood of being killed by police than their non-black peers. The Guardian's reporting supports that finding, showing that 28.2 percent of all people killed by police this year have been black, despite making up just 13.2 percent of the population.", "So how do white people in Iowa respond when police kill a white person under questionable circumstances in a heavily white neighborhood? If Des Moines is any example, they don't: A single protester showed up outside the police press conference on Wednesday, according to the Register. There was no wall-to-wall media coverage of large-scale demonstrations, because there were no demonstrations to cover.", "The city's apparent apathy is about more than racial demographics. Iowa generally has little experience with fatal police shootings. Bolinger is only the third person killed by police in the state in 2015, according to The Guardian. One was an ", "armed robbery suspect", " killed after allegedly pointing a gun at police following a car chase. The other was a woman ", "reportedly killed by an errant bullet", " fired by an officer who slipped while attempting to shoot a dog that had jumped on him. Both were white. (For comparison, the Los Angeles Police Department alone has ", "killed more than three times", " Iowa's total so far this year, which speaks to longstanding concerns about the LAPD's use of force.)", "Unlike New York or Ferguson, sites of protests following decisions not to charge police officers in killings of black men, Des Moines is more than 76 percent white, according to ", "Census data", ". And the state of Iowa as a whole is ", "92.5 percent white", ", nearly 30 percentage points higher than U.S. population, which is 62.6 percent white. But so was Bolinger, for that matter, and so were nearly 50 percent of all people killed by police this year, according to The Guardian.", "Bolinger's death didn't happen against a backdrop of tension between law enforcement and the community -- a tension that, in other places, forms an essential part of the Black Lives Matter message. But the outcome of his shooting is ultimately the same: an unarmed person is dead under circumstances that appear unnecessary and perhaps even avoidable. ", "While Black Lives Matter indeed focuses on the black experience, Bolinger's death underscores that many of the issues at the movement's core apply to people of all races. Many of the changes activists are championing would benefit all communities.", "This point is all too often lost on white critics of the Black Lives Matter movement. But it's time for all people, in any community touched by a police killing, to wake up.", "Though Des Moines has not felt the impact of police violence in the way many cities have, it hasn't been completely insulated from the ongoing debate over policing, nor from the racial narratives that have rightfully accompanied it. In May, a group of protesters ", "gathered under the Black Lives Matter mantle", " in Des Moines, calling for police reform and increased accountability. Photos from the event show that a number of the attendees were white.", "Amid the push for police reform and the broader reining in of the use of force, Bolinger's death is a reminder that while these issues affect some communities disproportionately, they can also affect any community at any time.", "More:", "Ryan Keith Bolinger", "Ryan Bolinger", "Ryan Bolinger Des Moines Police", "Ryan Bolinger Police", "Ryan Keith Bolinger Des Moines Police", "Police Killings", "Des Moines Police Killing", "Iowa Police Killing", "Ryan Keith Bolinger Iowa", "Police Brutality", "Police Brutality", "Suggest a correction", "Around the Web", "Officer inside patrol car fatally shoots unarmed man", "Report: 4 police killings in 24 hours bring total to 500", "Click here to view Conversations", "Conversations", "Suggested For You", "FOLLOW HUFFPOST", "Email", "Email Address", "Please check the checkbox to indicate your consent", "Options", "The Morning Email", "Politics", "\n                                        Get top stories and blog posts emailed to me each day..\n                                      ", "Facebook", "HuffPost", "Politics", "Twitter", "HuffPost", "Follow", "Politics", "Follow", "Google Plus", "HuffPost", "Politics", "RSS", "Most Popular on HuffPost", "Latest News", "Politics", "All RSS / Feeds", "Phone", "Available on the App Store", "Android App on Google Play", "Get it at Blackberry App World", "Search The Huffington Post", "Enter Search Terms", "Submit Search", "Advertise", "Log In", "Make HuffPost your Home Page", "RSS", "Careers", "FAQ", "User Agreement", "Privacy", "Comment Policy", "About Us", "About Our Ads", "Contact Us", "Copyright ©2015 TheHuffingtonPost.com, Inc.", "\"The Huffington Post\" is a registered trademark of TheHuffingtonPost.com, Inc. All rights reserved.", "Part of ", "HPMG News", "Use this form to alert a HuffPost editor about a factual or typographical error in this story.", "Notify message", "* Required", "*", "*", "*", "What kind of error is this?", "Choose an option", "Factual or typographical", "Comment moderation problem", "Rights and permissions", "Other", "*", " What is the correction?", "0 count", "Describe the error here (1,000 character limit)", "*", " Type the words below so we know you are not a cyborg                        ", "Sign me up for The Morning Email", "Thanks for your report!"]