["Subscribe", "Place Ad", "Buy Trib Photos", "Jobs", "Homes", "Search Autos", "Classifieds", "SportsTalk", "Contests", " | \r\n\r\nNews\r\n", "Home", "News", "Investigative", "Neighborhoods", "State", "Politics", "U.S./World", "Sports", "Opinion/The Review", "Business", "A&E", "Lifestyles", "Obituaries", "Columnists", "Allegheny", "Armstrong", "Beaver", "Butler", "Fayette", "Indiana", "Somerset", "Washington", "Westmoreland", "Health News", "On the Grid", "Education", "Pennsylvania", "Blogs", "Contact Us", " \r\n\t\r\n\t| ", "Order Photo Reprints", "More than 60 dying trees in Somerset County removed from where 2 girls died in accident", "Email Newsletters", "Click here", " to sign up for one of our email newsletters.\r\n", "Daily Photo Galleries", "\t\r\n\t\r\n\t\r\n\t\t\r\n\r\n\r\nWednesday - June 3, 2015\r\n\t\t\r\n\t", "By", " Matt Faye\r\n\t\r\n", " Wednesday, June 3, 2015, 5:39 p.m.", "Updated 2  hours ago", " More than 60 dead and dying trees have been removed from the Somerset County property where two children were killed in a freak car accident almost a year ago.  ", " The accident occurred June 23 on Route 403 between Davidsville and Tire Hill when a 2004 Pontiac Grand Am driven by Jason Himebaugh, 36, was hit by a 60-foot tree that fell onto the roadway. The car careened and struck a utility pole, authorities said.  ", " Dry rot caused the massive tree to fall, killing two sisters, 8-year-old Ryleigh Freiwald and 6-year-old Mikayla Freiwald, said Conemaugh Township Police.  ", " The girls' mother, Ashley Lichty, 26, and their sisters, Ciara Freiwald, 5, and Lillie Freiwald, 3, were injured but survived the crash. Lichty was eight months pregnant at the time; her unborn child also survived.   ", " The property owner now lives in Florida. His brother, Adam Thomas, oversaw the tree removal project.  ", " Initially there was some confusion about whether the tree that fell along the township-maintained road was on public or private property, but a PennDOT spokeswoman said the agency had no involvement with the recent tree removal. ", " Thomas hired Davey's Tree Services to remove the dying trees. ", " A neighbor of the property, Sandy Seth, said it took work crews two or three days to complete the job. She believes the tree removal will improve safety for drivers who travel Route 403. ", " â\u0080\u009cThe first time I drove down that road, all I saw was those trees,â\u0080\u009d said Seth. â\u0080\u009cThey cut pretty far back from the road, so I think it will make a big difference.â\u0080\u009d  ", " Within 24 hours of the accident, a gofundme account generated $10,370, surpassing the $10,000 the family needed to cover funeral expenses for the two girls' funerals and medical expenses for their mother, sisters and Himebaugh, according to the website. In the weeks after, more than $12,000 was raised for the victims' family through the online donation page Jamie's Dream Team. Donations to the fund can be made at ", "http://jamiedreamteam.myfastsite.net/donate/", ".  ", " No lawsuits regarding the accident have been filed to date.  ", "  Matt Faye is a staff writer for Trib Total Media. He can be reached at 724-836-6220 or ", "mfaye@tribweb.com", ". ", "Show commenting policy", "TribLive commenting policy", "You are solely responsible for your comments and by using TribLive.com you agree to our ", "Terms of Service", ". ", "We moderate comments. Our goal is to provide substantive commentary for a general readership. By screening submissions, we provide a space where readers can share intelligent and informed commentary that enhances the quality of our news and information.", "While most comments will be posted if they are on-topic and not abusive, moderating decisions are subjective. We will make them as carefully and consistently as we can. Because of the volume of reader comments, we cannot review individual moderation decisions with readers.", "We value thoughtful comments representing a range of views that make their point quickly and politely. We make an effort to protect discussions from repeated comments Â\u0097 either by the same reader or different readers.", "We follow the same standards for taste as the daily newspaper. A few things we won't tolerate: personal attacks, obscenity, vulgarity, profanity (including expletives and letters followed by dashes), commercial promotion, impersonations, incoherence, proselytizing and SHOUTING. Don't include URLs to Web sites.", "We do not edit comments. They are either approved or deleted. We reserve the right to edit a comment that is quoted or excerpted in an article. In this case, we may fix spelling and punctuation.", "We welcome strong opinions and criticism of our work, but we don't want comments to become bogged down with discussions of our policies and we will moderate accordingly.", "We appreciate it when readers and people quoted in articles or blog posts point out errors of fact or emphasis and will investigate all assertions. But these suggestions should be sent ", "via e-mail.", " To avoid distracting other readers, we won't publish comments that suggest a correction. Instead, corrections will be made in a blog post or in an article. ", "Most-Read Stories", "\r\n\r\n\r\nLemieux, Burkle explore sale of Penguins", "\r\n\r\n\r\nPirates sweep Giants behind another Mercer home run", "\r\n\r\n\r\nPirates notebook: Marte works through slump", "\r\n\r\n\r\nSteelers speedster Archer aims to find home in 2nd season", "\r\n\r\n\r\nPort Authority to remove â\u0080\u0098Zigginâ\u0080\u0099 Zagginâ\u0080\u0099 decals on buses because of racial slur complaint", "\r\n\r\n\r\nNorwin grad DelleFemine ends 3-sport career at Pitt", "\r\n\r\n\r\nMurrysville-area churches prepare for vacation Bible school season", "\r\n\r\n\r\nNorth Hills High School senior crafts staircase for family home", "\r\n\r\n\r\nWoman charged in Ligonier burglary", "\r\n\r\n\r\nSt. Sylvester student makes his mark at archery", "More Videos", "Video", " [Close] ", "eTrib", "The eTRIB is an electronic version of your favorite daily Trib Total Media newspaper edition. ", "You can read the Trib–or any of our other daily newspapers—anywhere, anytime! Read the eTRIB on your tablet, smartphone, iPad or iPhone.", "Available eTRIB editions include the Pittsburgh Trib, Greensburg Trib, Valley News Dispatch, Valley Independent, Daily News, Daily Courier and Leader Times.", "Click Here to Read or Subscribe Now!", "  See how it works  ", " [Close] ", "Total Promotional Solutions", "A division of Trib Total Media is your one-stop-shop for all of your branded merchandise needs.", "We specialize in providing quality affordable promotional products for every type of business including non-profits, schools, universities, sports teams and more. With 1000’s of products to choose from, our knowledgeable staff can help you find the perfect apparel item or product to suit your needs and budget.", "Why use TPSolutions?", " • Quality, brand name, screen printed and embroidered apparel", "\r\n\t\t\t\t\t\t\t\t• Competitive prices", "\r\n\t\t\t\t\t\t\t\t• Free design services", "\r\n\t\t\t\t\t\t\t\t• Volume and non-profit discounts available", "\r\n\t\t\t\t\t\t\t\t• Quick turn around", "For a free quote, email ", "promoproducts@tribweb.com", " or give us a call at ", "724-779-7146!", " [Close] ", "Digital Sales", "We offer a wide variety of traditional and new digital advertising options customized to fit your needs! ", "Whether you're just starting out, or you've been a keystone in the community for years, our knowledgeable staff can provide you with a customized package including online banners/advertisements, Social Media Marketing (Facebook / Twitter), Website development, Search Engine Optimization, Email Marketing solutions and much more! ", "Contact your local sales rep today for details, personalized proposal and a meeting to discuss how we can meet your needs.", "Click Here to get started!", "Newspapers", "Obituaries", "TribLIVE Mobile News", "TribLIVE Mobile Sports", "Pittsburgh Tribune-Review", "eTRIB Digital Replica", "Tribune-Review", "Blairsville Dispatch", "Daily Courier", "Valley Independent", "Valley News Dispatch", "Leader Times", "The Daily News", "Community Newspapers", "Marketplace", "Autos", "Classifieds", "Find Pittsburgh Jobs", "Homes", "Pittsburgh Pennysaver", "Store Circulars", "Photo Store", "Features", "Search", "Today's Stories", "RSS Feeds", "Site Map", "Contests", "Events Calendar", "Movie Showtimes", "Bloggers", "Video", "Your Town", "YourCranberry.com", "YourFoxChapel.com", "YourMonroeville.com", "YourNorthHills.com", "YourNorwin.com", "YourPennHills.com", "YourSewickley.com", "YourSouthHills.com", "YourTwinBoros.com", "Help & Services", "Contact Us", "Email Newsletters", "Feedback", "Subscriber Services", "Subscribe to our publications", "Commercial Printing", "Place a classified ad", "Print advertising", "Pittsburgh Newspaper Group", "Images and text copyright © 2015 — Trib Total Media, Inc.", "\r\n            Reproduction or reuse prohibited without written consent.", "Advertising Information", " |\r\n\t\t\t", "Terms of Service"]